# Арифметические операции

# Сложение
print(2 + 3)        # 5
print(0.1 + 0.2)    # 0.30000000000000004
print(0.1 + 0.3)    # 0.4

# Вычитание
print(2 - 3)        # -1

# Умножение
print(2 * 3)        # 6
print('la' * 5)     # lalalalala

# Деление
print(10 / 2)       # 5.0

# Деление по модулю (Возвращает остаток от деления)
print(3 % 2)        # 3 - 2 = 1
print(6 % 2)        # 6 - 2 - 2 - 2 = 0
print(6.2 % 3)      # 6.2 - 3 - 3 = 0.20000000000000018

# Целочисленное деление (Отбрасывается дробная часть)
print(3 // 2)       # 3 / 2 = 1.5 = 1
print(6 // 2)       # 6 / 2 = 3
print(6.2 // 3)     # 6.2 / 3 = 2.06 = 2.0

# Возведение в степень
print(5 ** 2)       # 25
print(5 ** 3)       # 125
print(25 ** 0.5)    # 5.0

# Приоритет операций
print(2 + 5 * 4)    # 22
print((2 + 5) * 4)  # 28